In [1]:
import sys
import sqlite3
import pandas as pd
import numpy as np

print("Python:", sys.version)
print("pandas:", pd.__version__)
print("numpy:", np.__version__)

Python: 3.13.11 (tags/v3.13.11:6278944, Dec  5 2025, 16:26:58) [MSC v.1944 64 bit (AMD64)]
pandas: 2.3.3
numpy: 2.4.1

In [2]:
con = sqlite3.connect("data/db/test.db")

df = pd.DataFrame({
    "id": [1,2,3],
    "name": ["Alice", "Bob", "Charlie"],
    "age": [24, 31, 29]
})

df.to_sql("Test", con, if_exists="replace", index=False)

con.close()

In [3]:
con = sqlite3.connect("data/db/test.db")
df = pd.read_sql("SELECT * FROM Test", con)
df

   id     name  age
0   1    Alice   24
1   2      Bob   31
2   3  Charlie   29